In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('./csv示例文件.csv', encoding='gbk', sep=',',index_col=[0])
df

     birthday name   AKA
0    1960/5/7  刘海柱  职业法师
1    1978/9/1  赵金龙   大力哥
2  1984/12/27  周立齐  窃格瓦拉
3   1969/1/24   于谦  相声皇后

In [7]:
from sqlalchemy import create_engine

In [8]:
# create_engine('mysql+pymysql://账号:密码@主机IP:3306/数据库?charset=编码格式')
engine = create_engine('mysql+pymysql://root:root@127.0.0.1:3306/test?charset=utf8')

In [9]:
df.to_sql('tb_students', engine, index=False, if_exists='append')

In [10]:
# 其实不仅可以把DataFrame对象写入数据到MySQL端；还可以从MySQL端读取数据

In [14]:
pd.read_sql('tb_students', engine)

     birthday name   AKA
0    1960/5/7  刘海柱  职业法师
1    1978/9/1  赵金龙   大力哥
2  1984/12/27  周立齐  窃格瓦拉
3   1969/1/24   于谦  相声皇后

In [15]:
pd.read_sql('select name, AKA from tb_students', engine)

  name   AKA
0  刘海柱  职业法师
1  赵金龙   大力哥
2  周立齐  窃格瓦拉
3   于谦  相声皇后